
var syMap  = {
    а: ["ا", "a"],
    ә: ["ءا", "á"],
    б: ["ب", "b"],
    в: ["ۆ", "v"],
    г: ["گ", "g"],
    ғ: ["ع", "ǵ"],
    д: ["د", "d"],
    е: ["ە", "e"],
    ж: ["ج", "j"],
    з: ["ز", "z"],
    и: ["ي", "i"],
    й: ["ي", "i"],
    к: ["ك", "k"],
    қ: ["ق", "q"],
    л: ["ل", "l"],
    м: ["م", "m"],
    н: ["ن", "n"],
    ң: ["ڭ", "ń"],
    о: ["و", "o"],
    ө: ["ءو","ó"],
    п: ["پ","p"],
    р: ["ر","r"],
    с: ["س","s"],
    т: ["ت","t"],
    у: ["ۋ","ý"],
    ұ: ["ۇ","u"],
    ү: ["ءۇ","ú"],
    ф: ["ف","f"],
    х: ["ح","h"],
    һ: ["ھ","h"],
    ц: ["چ","ch"],
    ш: ["ش","sh"],
    щ: ["شش","shsh"],
    ъ: ["",""],
    ы: ["ى","y"],
    і: ["ءى","ı"],
    ь: ["",""],
    э: ["يە","ie"],
    ю: ["يۋ","iý"],
    я: ["يا", "ia"],
    ё: ["يو", "io"],
    ч: ["تس","ts"],
}

// var syStr = "елғар , "



function syTranQaz(str, isLaten){
    var isLa = 0;
    if(isLaten){
        isLa = 1;
    }
    var qazStr = ""
    var len = str.length;
    for(var i = 0; i < len; i++){
        if(str[i] == " "){
            qazStr += " "
            continue;
        }
        if(syMap[str[i]] == undefined){
            qazStr += str[i]
            continue;
        }
        qazStr += syMap[str[i]][isLa];
    }
    return qazStr;
}

// var qaz = syTranQaz(syStr,1)
// console.log(qaz)













//西里尔文 unicod

// var xiUNArr = new Array("\u0430","\u04d9","\u0431",
//                         "\u0432","\u0433","\u0493",
//        "\u043b","\u043c","\u043d",
//                         "\u04a3","\u043e","\u04e9",
//                         "\u043f                   "\u0434","\u0435","\u0451",
//                         "\u0436","\u044d","\u0438",
//                         "\u0439","\u043a","\u049b",
//                       ","\u0440","\u0441",
//                         "\u0442","\u0443","\u04b1",
//                         "\u04af","\u0444","\u0445",
//                         "\u04bb","\u0446","\u0447",
//                         "\u0448","\u0449","\u044c",
//                         "\u044b","\u0456","\u044c",
//                         "\u044d","\u044e","\u044f"
//                         )


var arapArr = new Array("ا", "ٴا", "", "",
    "", "", "", "",
    "", "", "", "",
    "", "", "", "",
    "", "", "", "",
    "", "", "", "",
    "", "", "", "",
    "", "", "", "",
)


var xiArr = new Array("а", "ә", "б", "в",
    "г", "ғ", "д", "е",
    " ", "ж", "э", "и",
    "й", "к", "қ", "л",
    "м", "н", "ң", "о",
    "ө", "п", "р", "с",
    "т", "у", "ұ", "ү",
    "ф", "х", "һ", "ц",
    "ч", "ш", "щ", "ь",
    "ы", "і", "ь", "э",
    "ю", "я"
)
